---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewerPerspective
source: html/16294b0f-eb78-a7d2-da02-183fbbfd7152.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewerPerspective Property

"Projection Mode"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewerPerspective { get; }
```